goog.provide('numbers.Model');

goog.require('goog.events.EventTarget');

/**
 * @param {string} csv
 * @constructor
 */
numbers.Model = function(csv) {
  goog.events.EventTarget.call(this);
  this.setCsv_(csv);
};
goog.inherits(numbers.Model, goog.events.EventTarget);

/**
 * @type {Array.<Array.<string>>}
 */
numbers.Model.prototype.values_;

/**
 * @param {number} rowIndex
 * @param {number} columnIndex
 */
numbers.Model.prototype.getValueAt = function(rowIndex, columnIndex) {
  return this.values_[rowIndex][columnIndex];
};

/**
 * @return {number}
 */
numbers.Model.prototype.getColumnCount = function() {
  return this.values_[0].length;
};

/**
 * @return {number}
 */
numbers.Model.prototype.getRowCount = function() {
  return this.values_.length;
};

/**
 * @param {string} csv
 * @private
 */
numbers.Model.prototype.setCsv_ = function(csv) {
  this.values_ = [
['需求号','站号','站名','地址','图纸干放数量','协调人','物业联系人','实际干放数量','计划进场时间','实际进场时间','完工时间','开通时间','连接','干放位置','机房位置','熔纤盒数量','熔纤芯数（芯）','光纤（米）','施工人员','状态'],
['TD10116299','TDM20089','朝阳财政局TDBM','日坛北路3号','1','益振丰','张熙 13811525288','1','2012.8.29','2012.8.29','2012.8.29','','机房RRU','主楼 F3','主楼F5楼顶','2','4','20','黄少锋','替换完成'],
['TD10116383','TDM20790','朝阳国贸2座TDBM 写字楼','大北窑','1','钟圣','王工 65053860 ','1','2012.9.10','2012.9.10','2012.9.10','','B2—B1','B1竖井','顶层F38','2','4','35','黄少锋','替换完成'],
['TD10116263','TDM20204','崇文新世界正仁TDBM','崇外大街9号','2','刘海军','陈亚红 13501262261','2','2012.9.4','2012.9.4','2012.9.4','','B1竖井—B2 1竖井—B2 3竖井','B2 1竖井，B2 3竖井','B1','3','8','270','黄少锋','替换完成'],
['TD10116225','TDM20303','崇文天坛饭店TDBM','崇文区体育馆路1号','3','钟细林','13718836021 李总','3','2012.9.1','2012.9.1','2012.9.1','','机房','F5竖井、B1竖井、F1辅楼竖井','B1','3','10','500','黄少锋','替换完成2台，西配楼干放由于业主装修暂时先拆除干放未安装'],
['TD10116171','TDM20439','朝阳凯威大厦TDBM','雅宝路10号','1','郭欣','杜经理 13801178748','1','2012.8.22','2012.8.22','2012.8.22 ','','F16 RU','F7','F19','2','4','50','黄少锋','替换完成'],
['TD10116006','TDM25863','丰台东方医院TDBM','丰台区方庄小区芳星园一区6号楼','3','郭欣','马工 67689980/王科长 13910916280','3','2012.8.22','2012.8.30','2012.8.31','2012.8.31','F2竖井','F3弱电井、F3弱电井、F13电梯机房','F5','4','12','300','周帅','替换完成'],
['TD10115832','TDM25562','宣武人民政府TDBM','宣武区广安门南街68号宣武区人民政府A座11层电视机房','2','郭欣','刘工 15611811595','2','2012.9.11','2012.9.11','2012.9.11','','机房','F10东竖井、F10西竖井','F11','3','8','500','黄少锋','替换完成']
['TD10116142','TDM20522','朝阳凯泰公寓TDBM','朝阳区延静里中街3号','1','刘海军','13661361682 张经理','1','2012.9.3','2012.9.3','2012.9.3','2012.9.4','机房RRU','主楼F11竖井','F1','2','4','100','周帅','替换完成'],
['TD10116178','TDM20383','朝阳联合大厦TDBM','朝阳区联合大厦','2','刘海军','13552803664  潘工','2','2012.9.6','2012.9.6','2012.9.6','','F6先连到F15再连F4','F4、F15','F6','3','8','180','黄少锋','替换完成']
];
};
